# --- VCS ---
brew "git"
brew "gh"
brew "ghq"

# --- CLI UX ---
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# --- 基本ユーティリティ ---
brew "coreutils"
brew "gnu-tar"
brew "gpatch"
brew "wget"

# --- dotfiles ---
brew "chezmoi"

# --- Editor / Shell ---
brew "neovim"
brew "tmux"
brew "starship"

# --- Git / Docker TUI ---
brew "lazygit"
brew "lazydocker"

# --- Docker CLI ---
brew "docker"
brew "docker-compose"
brew "docker-buildx"

# --- Task runner（移行期間用）---
brew "make"